//////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////
// Move Class Active From Section To Section   Method 1
///////////////////////////////////////////////////////////

let currentLoc = window.location.pathname.toString().slice(1);

let allLinks = document.querySelectorAll(".path");

console.log(currentLoc);

allLinks.forEach((link) => {
  // let datar = link.dataset.href;
  let dataOne = link.getAttribute("data-href");

  if (dataOne === currentLoc) {
    link.classList.add("active");
  }
});


// ///////////////////////////////////////////////////////////////


//////////////////////////////////////////////
// Create Elements In ul And Loop For Array (Tourism)
////////////////////////////////////////////

let subjectsTwo = [
  "الإرشاد السياحي",
  "التشريعات السياحية",
  "الأمن السياحي",
  "تاريخ وآثار سوريا",
  "السياحة البيئية",
  "البروتوكول وخدمة الزبائن",
  "التسويق السياحي",
  "إدارة الموارد البشرية في السياحة",
  "إدارة الأزمات السياحية",
  "دراسة جدوى المشروعات السياحية",
  "السياحة الإلكترونية",
];

let descTwo = [
  "تاريخ الإرشاد السياحي واهمية وواجبات ومسؤوليات الدليل السياحي.",
  "التعرف على قوانين السياحة ومعرفة قوانين أنظمة المهن السياحية.",
  "أهمية الأمن السياحي بأطره العلمية والتطبيقية ضمن منهاج أكاديمي يكسبهم رؤية مستقبلية مهنية في مجال التنعامل مع قضايا الأمن السياحي",
  "الحضارات القديمة في سوريا، والمواقع الاثرية والدينية فيها.",
  "تعريف البيئة والسياحة البيئية والسياحة المستدامة وأهميتها والعلاقة فيما بينهما.",
  "لمعرفة القواعد التي تحكم طريقة الفرد في السلوك والأداء وكذلك معرفة سيكولوجية الضيف وطرق الخدمة المتبعة والمظهر والسلوك.",
  "مفهوم التسويق وأهميته في العملية السياحيةو كذلك خصوصية المنتج السياحي وعناصره المختلفة المرتبطة بالعرض والطلب السياحيين.",
  "الشؤون المتعلقة بالمصادر البشرية في السياحة، وتتضمن تحليل الوظائف، التوظيف، الاختيار، التوجيه، التدريب، كذلك التخطيط الوظيفي، رفع الاجور، الصحة والسلامة، وكذلك علاقات العمل.", 
  "مفهوم الأزمات السياحية وأسبابها وعواملها وكيفية التعامل معها ، إضافة إلى دراسة العوامل المؤثرة في النشاط السياحي.",
  "للتعرف على الخطوات اللازمة لإعداد دراسة جدوى لمشروع سياحي.",
  "أهمية الممارسات التجارية الإلكترونية في قطاع السياحة والبنية التحتية اللازمة والداعمة لهذه الممارسات.",
];

for (let i = 0; i < subjectsTwo.length; i++) {
  let li = document.createElement("li");

  ////////////
  // Title /////
  //////////////

  let h6 = document.createElement("h6");

  let content = document.createTextNode(`- ${subjectsTwo[i]}:`);

  h6.appendChild(content);

  li.appendChild(h6);

  ////////////
  // Paraghraph /////
  //////////////

  let p = document.createElement("p");

  let paraText = document.createTextNode(` ${descTwo[i]}`);

  p.appendChild(paraText);

  li.appendChild(p);

  //////////////////////////////////////

  let titles = document.querySelector(".tourism-managment ul.two");

  titles.appendChild(li);

  li.style.paddingBottom = "40px";

  p.style.marginBottom = "0";

  h6.style.marginBottom = "10px";

  h6.style.fontWeight = "bold";

}
