///////////////////////////////////////////////////////////////

//////////////////////////////////////////////
// Create Elements In Table And Loop For Array
/////////////////////////

let books = [
    "رحلة محمد سعيد الزعيم وعبد الحميد شوفان",
    "رحلة نيقولا المنوفي",
    "أسرار المدافن المصرية",
    "التاريخ الحديث",
    "الامة المسلولة",
    "مسافر الى سورية",
    "في تكوين الامة العربية",
    "آثار بلاد الرافدين",
    "الحدود التاريخية للعرب في بلاد الشام",
    "الاسطورة والمعنى",
    "مغامرة العقل الاولى",
    "الوجه الاخر للمسيح",
    "الحدث الثوراني",
    "مدخل الى نصوص الشرق القديم",
    "دين الانسان",
    "الرحمن والشيطان",
    "تاريخ اورسليم",
    "طريق اخوان الصفا",
    "موسوعة تاريخ الاديان",
    "تاريخ بلاد الشام منذ ماقبل الميلاد حتى نهاية العصر الاموي",
    "شهادات في هوامش التاريخ",
    "في رحاب العالم الحديث",
    "دراسة في نشوء الامة العربية",
    "النظام الدولي الجديد",
    "في المجتمع العربي قبل الاسلام",
    "دليل تطور الفكر الإداري",
    "في إدارة الاجتماعات",
    "إدارة المؤسسات والاسواق المالية",
    "تقنيات دراسة في الجدوى الاقتصادية",
    "التسويق الإلكتروني",
    "القاموس الفندقي",
    "التعليم الإلكتروني",
    "الآشوريون",
    "أفدم الحضارات",
    "الحكم والسياسة في العالم القديم",
    "الإنسان الاول",
    "إدارة الامن والسلامة الفندقية",
    "التسويق الفندقي",
    "إدارة الاعمال الدولية",
    "عشرة اعوام مع حافظ الاسد",
    "الآثار الاجتماعية والاقتصادية للحملات المغولية على بلاد الشام",
    "ديانة مصر الفرعونية",
    "الآلهة والمعتقدات لدى الرومان",
    "أحداث التاريخ الكبرى",
    "الحضارات الماضي والحاضر والمستقبل",
    "القرى الاولى في بلاد الشام",
    "الموجز في تاريخ الشام السياسي",
    "حوار الحضارات المعنى الافكار التقنيات",
    "حوار الحضارات والعلاقات الدولية",
    "حوار وشراكة الحضارات",
    "بادية الشام",
    "التعليم السريع",
    "الشخصية الايجابية",
    "الشخصية الذكية العبقرية",
    "تاريخ الحضارة البيزنطية",
    "الحروب الصليبية ",
    "اليهود في العصور المسمارية",
    "نظام الانتداب الفرنسي على سوريا",
    "اساطير الثورة الكبرى",
    "النصوص الكاملة لمخطوطات البحر الميت",
    "كيف توصل رسالتك في 30 ثانية",
    "قوة عقلك الباطن",
    "المفاتيح العشرة للنجاح",
    "الفراسة وقوة الحدث",
    "التفكير الايجابي",
    "قوة التحكم بالذات",
    "الطريق الى القمة",
    "العادات السبع للناس الأكثر فعالية",
    "التفاوض للفوز",
    "مزيد من الوقت من اجلك",
    "لغة الجسد",
    "حلل شخصيتك بنفسك",
    "الفراسة في معرفة الاخرين",
    "الفراسة في لغة الجسد",
    "لغة الجسد لسيدات ورجال الاعمال",
    "كيف تبني النجاح",
    "التعلم السريع دليل المستخدم",
    "تعلم الراشدين",
    "التعلم السريع",
    "العالم قبل الطوفان",
    "الاصول الغامضة للإنسان",
    "الامويون نشأة الفن الإسلامي",
    "القرى الاولى في بلاد الشام",
    "بلاغة الغروبسيك",
    "الإدارة في النظرية والتطبيق",
    "أسرار بابل",
    "الحكم والسياسة في العالم القديم",
    "معجم اسماء المدن والقرى في بلاد الشام الجنوبية",
    "من رحلات العرب",
    "رحلات الى الحجاز ونجد",
    "رحلة محمود البور سعيدي",
    "بلاغة الغروتسيك (المغارات والكهوف)",
    "ظواهر حضارية وجمالية في التاريخ القديم",
    "دمشق عبر العصور",
    "الحروب الصليبية",
    "تاريخ سورية الحضاري",
    "الطريق الى دمشق",
    "الانسان تجليات الازمنة (تاريخ وحضارة)",
    "مكتشفات مثيرة تغير تاريخ دمشق القديم",
    "عودة التاريخ في التأسيس الثيولوجيا العربية",
    "الجغرافية والرحلات عند العرب",
    "رحلات في سوريا والبلاد المقدسة",
    "المبيعات والتسويق في المنشآت السياحية",
    "العمل التجاري (إدارة العلاقات)",
    "حوار الحضارات",
    "ضيانة وترميم المكتشفات الأثرية",
    "لا تتسرع بالحلول",
    "عالم القرون الوسطى في أعين المسلمين",
    "الفن الإسلامي",
    "ترميم المباني الأثرية والمعمارية",
    "السياحة في سوريا",
    "عظمة بابل",
    "الفينيقيون واميركا",
    "مقجمة في تاريخ الحصارات القديمة",
    "كيف تجذب الناس كالمغناطيس (موارد بشرية)",
    "كيف تكسب الاصدقاء",
    "كيف تعامل مع الناس",
    "كيف تتغير الى الافضل",
    "فن قيادة الآخرين",
    "كيف تكتسب قوة الإرادة واحترام الذات",
    "كيف تعبر عند  بحثك عن عمل",
    "تدريس مهارات التفكير",
    "التسويق السياحي",
    "صناعة السياحة والأمن السياحي",
    "إدارة وكالات السفر",
    "إدارة وتنمية الموارد البشرية",
    "البرمجة اللغوية العصبية للمدراء",
    "عظمة أشور",
    "أقدم الحضارات",
    "دمشق في العصر الأيوبي",
    "اسبانيا ثلاثة الاف عام من التاريخ",
    "ساحل بلاد الشام والصراعات الدولية",
    "تاريخ سوريا 1908 - 1918",
    "تاريخ سوريا 1918 - 1920",
    "بادية الشام",
    "رحلة يان يسترون",
    "رحلة ابن الطيب",
    "رجلة ابن جبير",
    "دمشق في مطلغ القرن العشرين",
    "الأثنولوجيا",
    "االيهود زأرض كنعان",
    "رموز ومعجزات",
    "الفينيقيون والألعاب الأولومبية",
    "كيف تتعامل مع الناس",
    "كيف تصبح جذاباً ومؤثراً",
    "دليل المرشد النفسي للهندسة البشرية",
    "الاستخدام الاقصى لطاقات الدماغ",
    "الاصول الغامضة للانسان",
    "مناهج البحث الاثاري",
    "السلزك التنظيمي وإدارة الموارد البشرية",
    "الدليل العربي الانكليزي الكامل للسياح ورجال الاعمال",
    "قرطاجة",
    "المشاهد والاثار في بلاد الشام",
    "كيف تحتفظ بجودة اعمالك",
    "التسويق",
    "نظم المعلومات الإدارية",
    "الأزمات الاقتصادية العالمية",
  ];
  
  for (let i = 0 ; i < books.length ; i++) {
  
    let tr = document.createElement("tr");
  
    let td = document.createElement("td");
  
    tr.appendChild(td);
  
    let number = document.createTextNode([i + 1]);
  
    td.appendChild(number);
  
    let tdTwo = document.createElement("td");
  
    let text = document.createTextNode(books[i]);
  
    tdTwo.appendChild(text);
   
    tr.appendChild(tdTwo);
  
    let tbody = document.querySelector(".table-books tbody");
  
    tbody.appendChild(tr);
  }
  

  //////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////
// Move Class Active From Section To Section   Method 1
///////////////////////////////////////////////////////////

let currentLoc = window.location.pathname.toString().slice(1);

let allLinks = document.querySelectorAll(".path");

console.log(currentLoc);

allLinks.forEach((link) => {
  // let datar = link.dataset.href;
  let dataOne = link.getAttribute("data-href");

  if (dataOne === currentLoc) {
    link.classList.add("active");
  }
});


/////////////////////////////////////
// Show Top Button When Scroll Down
/////////////////////////////////////


let upButton = document.querySelector(".top");

window.onscroll = function () {
  if (window.scrollY >= 3000) {
    upButton.style.opacity = "1";
  } else {
    upButton.style.opacity = "0";
  }
};